/*****************************************************************//**
 * @file    WireEventData.h
 * @brief   ワイヤーイベントのデータに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/06/25
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include <SimpleMath.h>

// クラスの前方宣言 ===================================================
class GameObject;





// 構造体の定義 ===============================================================
/**
 * @brief ワイヤーイベントのデータ
 */
struct WireEventData
{
public:
	DirectX::SimpleMath::Vector3 grabPos;	///< グラップ座標
	const GameObject* pOwner;						///< 所有者

	WireEventData()
		: pOwner{ nullptr }
		, grabPos{}
	{}

};
