/*****************************************************************//**
 * @file    PlayerInput.h
 * @brief   プレイヤー入力に関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/10/15
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include <unordered_map>

// クラスの前方宣言 ===================================================

// クラスの定義 ===============================================================
/**
 * @brief プレイヤー入力
 */
class PlayerInput
{
// 列挙型 -------------------------------------------------
public:
	enum class InputID
	{
	};

// 構造体-------------------------------------------------
public:

	struct InputData
	{
		DirectX::Keyboard::Keys key;
		bool isInput;
	};

	std::unordered_map<InputID, InputData> m_judgementKeys;

// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	PlayerInput();

	// デストラクタ
	~PlayerInput();


// 操作
public:

	// 更新処理
	void Update(const DirectX::Keyboard::KeyboardStateTracker&  keyboardState);



// 取得/設定
public:


// 内部実装
private:


};
