/*****************************************************************//**
 * @file    ElapsedTimeCounter.h
 * @brief   経過時間カウンタクラスに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/01/13
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================

// クラスの前方宣言 ===================================================

// クラスの定義 ===============================================================
/**
 * @brief 経過時間カウンタ
 */
class ElapsedTimeCounter
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:

	float m_elapsedTime;	///< 経過時間(秒)

// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	ElapsedTimeCounter();

	// デストラクタ
	~ElapsedTimeCounter();


// 操作
public:

	// 経過時間を加算
	void UpperTime(float deltaTime);

	// 経過時間をリセット
	void Reset();

// 取得/設定
public:

	// 経過時間の取得
	float GetElapsedTime() const { return m_elapsedTime; };

// 内部実装
private:


};
