/*****************************************************************//**
 * @file    WalkPlayerState.h
 * @brief   歩行状態のプレイヤーに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/06/18
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include "Game/Common/StateMachine/StateBase/StateBase.h"


// クラスの前方宣言 ===================================================
class Player;

// クラスの定義 ===============================================================
/**
 * @brief 歩行状態のプレイヤー
 */
class WalkPlayerState : public StateBase<Player>
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	WalkPlayerState();

	// デストラクタ
	~WalkPlayerState();


// 操作
public:

	// 開始処理
	void OnStartState() override;

	// 更新処理
	void OnUpdate(float deltaTime) override;

	// 描画処理
	void OnDraw() override;




// 取得/設定
public:


// 内部実装
private:


};
