/*****************************************************************//**
 * @file    CollisionDispatcher.h
 * @brief   コライダーごとの衝突判定をするクラスに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    ××××/××/××
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================
class ICollider;// コライダーのインターフェース

// クラスの定義 ===============================================================
/**
 * @brief コライダーごとの衝突判定をするクラス
 */
class CollisionDispatcher
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	CollisionDispatcher();

	// デストラクタ
	~CollisionDispatcher();


// 操作
public:
	
	// 衝突判定
	static bool DetectCollision(const ICollider* pColliderA, const ICollider* pColliderB);
};
