/*****************************************************************//**
 * @file    IGameEffect.h
 * @brief   ゲームエフェクトのインターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/10/11
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================
class Camera; // カメラ

// クラスの定義 ===============================================================
/**
 * @brief ゲームエフェクトのインターフェース
 */
class IGameEffect
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	IGameEffect();

	// デストラクタ
	virtual ~IGameEffect();


// 操作
public:

	// 再生
	virtual void Play() = 0;

	// 更新処理
	virtual void Update(float deltaTime) = 0;
	// 描画処理
	virtual void Draw(const Camera& camera) = 0;

// 取得/設定
public:

	// 再生してるかどうか
	virtual bool IsPlaying() const = 0;


// 内部実装
private:


};
