/*****************************************************************//**
 * @file    MainCamera.h
 * @brief   メインカメラに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/10/14
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================
class Camera; // カメラ

// クラスの定義 ===============================================================
/**
 * @brief メインカメラ
 */
class MainCamera
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:
	Camera* m_pMainCamera; ///< メインカメラ

	static std::unique_ptr<MainCamera> s_instance; // インスタンス

// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
private:
	// コンストラクタ
	MainCamera();
public:
	// デストラクタ
	~MainCamera();


// 操作
public:
	


// 取得/設定
public:

	// インスタンス
	static MainCamera* GetInstance();

	// カメラを設定する
	void SetCamera(Camera* pCamera);
	// カメラの取得
	const Camera* GetCamera() const;

// 内部実装
private:


};
