/*****************************************************************//**
 * @file    IEnemy.h
 * @brief   敵インターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/07/31
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================
class CommonResources;	// 共通リソース
class CollisionManager;	// 衝突管理
class Camera;			// カメラ

// クラスの定義 ===============================================================
/**
 * @brief 敵インターフェース
 */
class IEnemy
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	IEnemy() = default;

	// デストラクタ
	virtual ~IEnemy() = default;


// 操作
public:

	// 初期化処理
	virtual void Initialize(const CommonResources* pCommonResources, CollisionManager* pCollisionManager) = 0;

	// 更新処理
 	virtual void Update(float deltaTime) = 0;

	// 描画処理
	virtual void Draw(const Camera& camera) = 0;

};
