/*****************************************************************//**
 * @file    SimParticle.h
 * @brief   シミュレーションで使われるパーティクルに関するソースファイル
 *
 * @author  松下大暉
 * @date    2025/05/14
 *********************************************************************/

// ヘッダファイルの読み込み ===================================================
#include "pch.h"
#include "SimParticle.h"




// メンバ関数の定義 ===========================================================
/**
 * @brief コンストラクタ
 *
 * @param[in] なし
 */
SimParticle::SimParticle()
{

}



/**
 * @brief デストラクタ
 */
SimParticle::~SimParticle()
{

}


