/*****************************************************************//**
 * @file    IEnemyFactory.h
 * @brief   敵の生成インターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/08/24
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include <memory>

// クラスの前方宣言 ===================================================
class Enemy;
class Player;
// クラスの定義 ===============================================================
/**
 * @brief 敵の生成インターフェース
 */
class IEnemyFactory
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	IEnemyFactory() = default;

	// デストラクタ
	virtual ~IEnemyFactory() = default;

public:

	// 作成
	virtual std::unique_ptr<Enemy> Create() = 0;


};
