/*****************************************************************//**
 * @file    GameEffectBase.h
 * @brief   ゲームエフェクト基底に関するソースファイル
 *
 * @author  松下大暉
 * @date    2025/10/11
 *********************************************************************/

// ヘッダファイルの読み込み ===================================================
#include "pch.h"
#include "GameEffectBase.h"




// メンバ関数の定義 ===========================================================
/**
 * @brief コンストラクタ
 *
 * @param[in] なし
 */
GameEffectBase::GameEffectBase()
{

}



/**
 * @brief デストラクタ
 */
GameEffectBase::~GameEffectBase()
{

}



