/*****************************************************************//**
 * @file    IGameEffect.h
 * @brief   ゲームエフェクトインターフェースに関するソースファイル
 *
 * @author  松下大暉
 * @date    2025/10/11
 *********************************************************************/

// ヘッダファイルの読み込み ===================================================
#include "pch.h"
#include "IGameEffect.h"




// メンバ関数の定義 ===========================================================
/**
 * @brief コンストラクタ
 *
 * @param[in] なし
 */
IGameEffect::IGameEffect()
{

}



/**
 * @brief デストラクタ
 */
IGameEffect::~IGameEffect()
{

}
