/*****************************************************************//**
 * @file    IConstraintFactory.h
 * @brief   制約のインターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/10/09
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================
class IConstraint;
class SimParticle;

// クラスの定義 ===============================================================
/**
 * @brief 制約の生成インターフェース
 */
class IConstraintFactory
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	IConstraintFactory() = default;

	// デストラクタ
	virtual ~IConstraintFactory() = default;

	// 制約の作成
	virtual bool CreateConstraint(SimParticle* pParticle, std::unique_ptr<IConstraint>* constraint) = 0;



// 取得/設定
public:


};
