/*****************************************************************//**
* @file    ISprite2D.h
* @brief   スプライト2Dのインターフェースに関するヘッダーファイル
*
* @author  松下大暉
* @date    2025/04/03
*********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================
#include <SpriteBatch.h>

// クラスの前方宣言 ===================================================


// クラスの定義 ===============================================================
/**
* @brief スプライト2Dのインターフェース
*/
class ISprite2D
{

// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
   // コンストラクタ
   ISprite2D() = default;

   // デストラクタ
   ~ISprite2D() = default;

// 操作
public:
   // スプライト描画
   virtual void DrawSprite(DirectX::SpriteBatch* pSpriteBatch) = 0;
};
