/*****************************************************************//**
 * @file    EntityManager.h
 * @brief   エンティティ管理クラスに関するヘッダーファイル ＜＜未実装＞＞
 *
 * @author  松下大暉
 * @date    2025/10/15
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include <vector>
#include <memory>

// クラスの前方宣言 ===================================================
class IEntity; // エンティティインターフェース

// クラスの定義 ===============================================================
/**
 * @brief エンティティ管理
 */
class EntityManager
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:

	//std::vector<IEntity> m_entities; // エンティティリスト

// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	EntityManager();

	// デストラクタ
	~EntityManager();


// 操作
public:
	// 初期化処理
	void Initialize();

	// 更新処理
	void UpdateEntity(float deltaTime);

	// 描画処理
	void DrawEntity(const DirectX::SimpleMath::Matrix& view, const DirectX::SimpleMath::Matrix& proj);

	// 終了処理
	void Finalize();


// 取得/設定
public:


// 内部実装
private:


};
