/*****************************************************************//**
 * @file    IEntity.h
 * @brief   エンティティのインターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/10/15
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================

// クラスの定義 ===============================================================
/**
 * @brief エンティティのインターフェース＜＜未実装＞＞
 */
class IEntity
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	IEntity() = default;
 
	// デストラクタ
	virtual ~IEntity() = default;


// 操作
public:
	// 更新処理
	virtual void Update(float deltaTime) = 0;

	// 描画処理
	virtual void Draw(const DirectX::SimpleMath::Matrix& view, const DirectX::SimpleMath::Matrix& projection) = 0;



};
