/*****************************************************************//**
 * @file    IEnemyDrawBehaviour.h
 * @brief   敵の描画処理インターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/08/24
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================
class Enemy;

// クラスの定義 ===============================================================

/**
 * @brief 敵の描画処理インターフェース
 */
class IEnemyDrawBehaviour
{

public:
	virtual ~IEnemyDrawBehaviour() = default;


public:
	// 更新処理
	virtual void Draw(Enemy* pEnemy) = 0;

};
