/*****************************************************************//**
 * @file    ICollision.h
 * @brief   衝突のインターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date	2025/03/22
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================
class GameObject;	// ゲームオブジェクト
class ICollider;	// コライダー

// クラスの定義 ===============================================================
/**
 * @brief 衝突判定
 */
class ICollision
{
// コンストラクタ・デストラクタ
public:
	// コンストラクタ
	ICollision() = default;
	// デストラクタ
	virtual ~ICollision() = default;

// メンバ関数の宣言 ------------------------------------------------

// 操作
public:

	// 衝突処理
	virtual  void OnCollision(GameObject* pHitObject, ICollider* pHitCollider)  = 0;

	// 衝突判定をする直前に行う処理
	virtual void PreCollision() {};

	// 衝突判定をした直後に行う処理
	virtual void PostCollision() {};

};
