/*****************************************************************//**
 * @file    ExitController.h
 * @brief   終了操作に関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/01/23
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================

// クラスの定義 ===============================================================
/**
 * @brief 終了操作
 */
class ExitController
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:

	static bool m_isExit;	///< 終了するかどうか

// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	ExitController();

	// デストラクタ
	~ExitController();


// 操作
public:

	// インスタンス取得メソッド
	static ExitController& GetInstance();

	// 終了するかどうかの取得
	static bool IsExit();

	// 終了する
	static void ExitGame();



// 取得/設定
public:


// 内部実装
private:


};
