/*****************************************************************//**
 * @file    IWireHolder.h
 * @brief   ワイヤーを所持するもののインターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/07/02
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================
class GameObject;

// クラスの定義 ===============================================================
/**
 * @brief ワイヤーを所持するもののインターフェース
 */
class IWireHolder
{


// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	IWireHolder() = default;

	// デストラクタ
	virtual ~IWireHolder() = default;


// 操作
public:
	
	// ワイヤーが衝突した時に呼ばれる
	virtual void OnCollisionWire(GameObject* pHitGameObject) = 0;

	// ワイヤーが掴んだ時に呼ばれる
	virtual void OnWireGrabbed(GameObject* pGrabGameObject) = 0;

};
