/*****************************************************************//**
 * @file    ICollider.h
 * @brief   コライダーのインターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date	2025/03/22
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================

/**
 * @brief コライダーの種類
 */
enum class ColliderType
{
	Sphere,		// 球
	Triangle,	// 三角形
	BOX2D,		// 矩形
	BOX3D,		// 直方体
	Plane,		// 平面
	Segment,	// 線分
	AABB,		// ボックス
	Cylinder,	// 筒
	Capsule,	// カプセル

};

// クラスの定義 ===============================================================
/**
 * @brief コライダー
 */
class ICollider
{

	// コンストラクタ・デストラクタ
public:
	// コンストラクタ
	ICollider() = default;
	// デストラクタ
	virtual ~ICollider() = default;

// メンバ関数の宣言 -------------------------------------------------


// 取得/設定
public:
	// クローンの取得
	virtual std::unique_ptr<ICollider> GetClone() const = 0;
	// コライダーの種類の取得
	virtual  ColliderType GetColliderType() const = 0;


};
