/*****************************************************************//**
 * @file    WireThrowingPlayerState.cpp.h
 * @brief   ワイヤーで投げる状態のプレイヤーに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/06/18
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include "Game/Common/StateMachine/StateBase/StateBase.h"


// クラスの前方宣言 ===================================================
class Player;

// クラスの定義 ===============================================================
/**
 * @brief ワイヤーで投げる状態のプレイヤー
 */
class WireThrowingPlayerState : public StateBase<Player>
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	WireThrowingPlayerState();

	// デストラクタ
	~WireThrowingPlayerState();


// 操作
public:

	// 状態の開始
	void OnStartState() override;

	// 更新処理
	void OnUpdate(float deltaTime) override;





// 取得/設定
public:


// 内部実装
private:


};
