/*****************************************************************//**
 * @file    Ray.h
 * @brief   レイに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/07/02
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include "Game/Common/Collision/Collision.h"

// クラスの前方宣言 ===================================================

namespace MyLib
{

	// クラスの定義 ===============================================================
	/**
	 * @brief レイ
	 */
	struct Ray
	{
		// クラス定数の宣言 -------------------------------------------------
	public:



		// データメンバの宣言 -----------------------------------------------
	public:


			DirectX::SimpleMath::Vector3 direction;	///< 方向ベクトル
			DirectX::SimpleMath::Vector3 origin;	///< 原点


		// メンバ関数の宣言 -------------------------------------------------
		// コンストラクタ/デストラクタ
	public:
		// コンストラクタ
		Ray(const DirectX::SimpleMath::Vector3& origin, const DirectX::SimpleMath::Vector3& direction );
		Ray() = default;

		// デストラクタ
		~Ray();




	};
};