/*****************************************************************//**
 * @file    NormalGameplayState.h
 * @brief   ゲームプレイシーンの通常状態に関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/09/15
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include "Game/Common/StateMachine/StateBase/StateBase.h"


// クラスの前方宣言 ===================================================
class GameplayScene; // ゲームプレイシーン

// クラスの定義 ===============================================================
/**
 * @brief ゲームプレイシーンの通常状態
 */
class NormalGameplayState
	: public StateBase<GameplayScene>
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	NormalGameplayState();

	// デストラクタ
	~NormalGameplayState();


// 操作
public:
	// 開始処理
	void OnStartState() override;

	// 更新処理
	void OnUpdate(float elapsedTime) override;

	// 描画処理
	void OnDraw() override;




// 取得/設定
public:


// 内部実装
private:


};
