/*****************************************************************//**
 * @file    Prop.h
 * @brief   ステージ上に配置される背景オブジェクトの基底クラスに関するソースファイル
 *
 * @author  松下大暉
 * @date    2025/08/24
 *********************************************************************/

// ヘッダファイルの読み込み ===================================================
#include "pch.h"
#include "Prop.h"




// メンバ関数の定義 ===========================================================
/**
 * @brief コンストラクタ
 *
 * @param[in] なし
 */
Prop::Prop()
	: m_tileNumber{}
{

}



/**
 * @brief デストラクタ
 */
Prop::~Prop()
{

}






