/*****************************************************************//**
 * @file    GameFlowEventID.h
 * @brief   ゲーム進行イベントの識別子に関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/08/24
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once

/**
 * @brief ゲーム進行イベントの識別子
 */
enum class GameFlowEventID
{
	GAME_START,		// ゲーム開始

	STOLE_TREASURE, // 宝物を盗んだ
	SPAWN_HELICOPTER,// ヘリコプターの出現
	PLAYER_DIE,		// プレイヤーの志望
	
	ESCAPE_SUCCESS, // 脱出成功
};




