/*****************************************************************//**
 * @file    IGameFlowObserver.h
 * @brief   ゲームイベントの監視者のインターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/08/24
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================
#include "Game/Common/Event/Messenger/GameFlowMessenger/GameFlowEventID.h"

// クラスの前方宣言 ===================================================

// クラスの定義 ===============================================================
/**
 * @brief ゲームイベントの監視者のインターフェース
 */
class IGameFlowObserver
{
// クラス定数の宣言 -------------------------------------------------
public:



// データメンバの宣言 -----------------------------------------------
private:



// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	IGameFlowObserver() = default;

	// デストラクタ
	virtual ~IGameFlowObserver() = default;


// 操作
public:

	// イベントメッセージを受け取る
	virtual void OnGameFlowEvent(GameFlowEventID eventID) = 0;


};
