/*****************************************************************//**
 * @file    IEnemyInitializeBehaviour.h
 * @brief   敵の初期化処理インターフェースに関するヘッダーファイル
 *
 * @author  松下大暉
 * @date    2025/08/24
 *********************************************************************/

// 多重インクルードの防止 =====================================================
#pragma once




// ヘッダファイルの読み込み ===================================================


// クラスの前方宣言 ===================================================
class Enemy;

// クラスの定義 ===============================================================
/**
 * @brief 敵の初期化処理インターフェース
 */
class IEnemyInitializeBehaviour
{
public:
	virtual ~IEnemyInitializeBehaviour() = default;


public:
	// 更新処理
	virtual void Initialize(Enemy* pEnemy) = 0;

};
