/*****************************************************************//**
 * @file    EventData.h
 * @brief   イベントデータに関するソースファイル
 *
 * @author  松下大暉
 * @date    2025/07/06
 *********************************************************************/

// ヘッダファイルの読み込み ===================================================
#include "pch.h"
#include "EventData.h"




// メンバ関数の定義 ===========================================================
/**
 * @brief コンストラクタ
 *
 * @param[in] なし
 */
EventData::EventData()
{

}



/**
 * @brief デストラクタ
 */
EventData::~EventData()
{

}

